
Процедура Действие3ПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Оператор1С;
КонецПроцедуры

Процедура Действие2ПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Администратор1С;
КонецПроцедуры

Процедура Действие1ПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Программист1С;
КонецПроцедуры



Процедура Условие1ПроверкаУсловия(ТочкаМаршрута, Результат)
	Результат = ПройденТестПрограммирование;
КонецПроцедуры

Процедура УсловиеПроверкаУсловия(ТочкаМаршрута, Результат)
	Результат = ПройденТестАдминистрирование;
КонецПроцедуры
