ДвухзначноеЧисло = 10;
Степень = 5;

МодульЧисла = Pow(ДвухзначноеЧисло, Степень);

Сообщить("При возведении " + ДвухзначноеЧисло + " в " + Степень + " степень будет получено число " + МодульЧисла);
Если МодульЧисла > 10000 Тогда
	Сообщить("Получившееся число больше 10 000");
КонецЕсли;

//Определение дня недели
ДниНедели = Новый Массив;
ДниНедели.Добавить("Понедельник");
ДниНедели.Добавить("Вторник");
ДниНедели.Добавить("Среда");
ДниНедели.Добавить("Четверг");
ДниНедели.Добавить("Пятница");
ДниНедели.Добавить("Суббота");
ДниНедели.Добавить("Воскресенье");
Ответ = "";
Счетчик = 0;

Пока Счетчик < 10 Цикл        
    Ответ = Ответ + " " + ДниНедели[ДеньНедели(Дата(2022+Счетчик, 12, 31)) - 1];
    Счетчик = Счетчик + 1;     
КонецЦикла; 

Сообщить(Ответ);